:PROPERTIES:
:ID:       b03a69ac-966c-4289-afcc-c93ed8f32578
:END:
#+TITLE: Emacs keys: Convert gnus keybindings to svg
#+CATEGORY: slips
#+TAGS:

* Gnus Groups

Use =embark-bindings= within the main =gnus-group= buffer, run =embark-collect=
then convert to table.

#+name: ggroup-raw
| short        | key | command                                 | desc                                                                 |
|--------------+-----+-----------------------------------------+----------------------------------------------------------------------|
| mark         | #   | gnus-group-mark-group                   | Mark the current group.                                              |
| best-unread  | ,   | gnus-group-best-unread-group            | Go to the group with the highest level.                              |
| first-unread | .   | gnus-group-first-unread-group           | Go to the first group with unread articles.                          |
| select       | =   | gnus-group-select-group                 | Select this newsgroup.                                               |
| desc         | ?   | gnus-group-describe-briefly             | Give a one line description of the group mode commands.              |
| server       | ^   | gnus-group-enter-server-mode            | Jump to the server buffer.                                           |
| post         | a   | gnus-group-post-news                    | Start composing a message (a news by default).                       |
| browse       | B   | gnus-group-browse-foreign-server        | Browse a foreign news server.                                        |
| bogus        | b   | gnus-group-check-bogus-groups           | Check bogus newsgroups.                                              |
| catchup-all  | C   | gnus-group-catchup-current-all          | Mark all articles in current newsgroup as read.                      |
| catchup      | c   | gnus-group-catchup-current              | Mark all unread articles in the current newsgroup as read.           |
| find-new     | F   | gnus-group-find-new-groups              | Search for new groups and add them.                                  |
| get-new      | g   | gnus-group-get-new-news                 | Get newly arrived articles.                                          |
| news         | i   | gnus-group-news                         | Start composing a news.                                              |
| jump         | j   | gnus-group-jump-to-group                | Jump to newsgroup GROUP.                                             |
| list-all     | L   | gnus-group-list-all-groups              | List all newsgroups with level ARG or lower.                         |
| list         | l   | gnus-group-list-groups                  | List newsgroups with level LEVEL or lower that have unread articles. |
| mail         | m   | gnus-group-mail                         | Start composing a mail.                                              |
| next         | N   | gnus-group-next-group                   | Go to next N’th newsgroup.                                           |
| next-unread  | n   | gnus-group-next-unread-group            | Go to next N’th unread newsgroup.                                    |
| prev         | P   | gnus-group-prev-group                   | Go to previous N’th newsgroup.                                       |
| prev-unread  | p   | gnus-group-prev-unread-group            | Go to previous N’th unread newsgroup.                                |
| quit         | Q   | gnus-group-quit                         | Quit reading news without updating .newsrc.eld or .newsrc.           |
| exit         | q   | gnus-group-exit                         | Quit reading news after updating .newsrc.eld and .newsrc.            |
| restart      | R   | gnus-group-restart                      | Force Gnus to read the .newsrc file.                                 |
| read-init    | r   | gnus-group-read-init-file               | Read the Gnus elisp init file.                                       |
| save-newsrc  | s   | gnus-group-save-newsrc                  | Save the Gnus startup files.                                         |
| toggle       | U   | gnus-group-toggle-subscription          |                                                                      |
| toggle-at-p  | u   | gnus-group-toggle-subscription-at-point | Toggle subscription of the current group.                            |
| suspend      | z   | gnus-group-suspend                      | Suspend the current Gnus session.                                    |

handles table input, but not output

#+begin_src jq :results output table :stdin ggroup-raw :compact yes
. | first | {"pos": .key }
#+end_src

#+RESULTS:
: {"pos":"#"}

#+name: ggroup-simple
| short   | key                         | command                                 | desc |
|---------+-----------------------------+-----------------------------------------+------|
| C-x C-t | gnus-group-transpose-groups | Move the current newsgroup up N places. |      |

#+begin_src jq :stdin ggroup-simple
. | first |
#+end_src

#+RESULTS:
#+begin_example
[
  {
    "short": "mark",
    "key": "#",
    "command": "gnus-group-mark-group",
    "desc": "Mark the current group."
  },
  {
    "short": "best-unread",
    "key": ",",
    "command": "gnus-group-best-unread-group",
    "desc": "Go to the group with the highest level."
  },
  {
    "short": "first-unread",
    "key": ".",
    "command": "gnus-group-first-unread-group",
    "desc": "Go to the first group with unread articles."
  },
  {
    "short": "select",
    "key": "=",
    "command": "gnus-group-select-group",
    "desc": "Select this newsgroup."
  },
  {
    "short": "desc",
    "key": "?",
    "command": "gnus-group-describe-briefly",
    "desc": "Give a one line description of the group mode commands."
  },
  {
    "short": "server",
    "key": "^",
    "command": "gnus-group-enter-server-mode",
    "desc": "Jump to the server buffer."
  },
  {
    "short": "post",
    "key": "a",
    "command": "gnus-group-post-news",
    "desc": "Start composing a message (a news by default)."
  },
  {
    "short": "browse",
    "key": "B",
    "command": "gnus-group-browse-foreign-server",
    "desc": "Browse a foreign news server."
  },
  {
    "short": "bogus",
    "key": "b",
    "command": "gnus-group-check-bogus-groups",
    "desc": "Check bogus newsgroups."
  },
  {
    "short": "catchup-all",
    "key": "C",
    "command": "gnus-group-catchup-current-all",
    "desc": "Mark all articles in current newsgroup as read."
  },
  {
    "short": "catchup",
    "key": "c",
    "command": "gnus-group-catchup-current",
    "desc": "Mark all unread articles in the current newsgroup as read."
  },
  {
    "short": "find-new",
    "key": "F",
    "command": "gnus-group-find-new-groups",
    "desc": "Search for new groups and add them."
  },
  {
    "short": "get-new",
    "key": "g",
    "command": "gnus-group-get-new-news",
    "desc": "Get newly arrived articles."
  },
  {
    "short": "news",
    "key": "i",
    "command": "gnus-group-news",
    "desc": "Start composing a news."
  },
  {
    "short": "jump",
    "key": "j",
    "command": "gnus-group-jump-to-group",
    "desc": "Jump to newsgroup GROUP."
  },
  {
    "short": "list-all",
    "key": "L",
    "command": "gnus-group-list-all-groups",
    "desc": "List all newsgroups with level ARG or lower."
  },
  {
    "short": "list",
    "key": "l",
    "command": "gnus-group-list-groups",
    "desc": "List newsgroups with level LEVEL or lower that have unread articles."
  },
  {
    "short": "mail",
    "key": "m",
    "command": "gnus-group-mail",
    "desc": "Start composing a mail."
  },
  {
    "short": "next",
    "key": "N",
    "command": "gnus-group-next-group",
    "desc": "Go to next N’th newsgroup."
  },
  {
    "short": "next-unread",
    "key": "n",
    "command": "gnus-group-next-unread-group",
    "desc": "Go to next N’th unread newsgroup."
  },
  {
    "short": "prev",
    "key": "P",
    "command": "gnus-group-prev-group",
    "desc": "Go to previous N’th newsgroup."
  },
  {
    "short": "prev-unread",
    "key": "p",
    "command": "gnus-group-prev-unread-group",
    "desc": "Go to previous N’th unread newsgroup."
  },
  {
    "short": "quit",
    "key": "Q",
    "command": "gnus-group-quit",
    "desc": "Quit reading news without updating .newsrc.eld or .newsrc."
  },
  {
    "short": "exit",
    "key": "q",
    "command": "gnus-group-exit",
    "desc": "Quit reading news after updating .newsrc.eld and .newsrc."
  },
  {
    "short": "restart",
    "key": "R",
    "command": "gnus-group-restart",
    "desc": "Force Gnus to read the .newsrc file."
  },
  {
    "short": "read-init",
    "key": "r",
    "command": "gnus-group-read-init-file",
    "desc": "Read the Gnus elisp init file."
  },
  {
    "short": "save-newsrc",
    "key": "s",
    "command": "gnus-group-save-newsrc",
    "desc": "Save the Gnus startup files."
  },
  {
    "short": "toggle",
    "key": "U",
    "command": "gnus-group-toggle-subscription",
    "desc": ""
  },
  {
    "short": "toggle-at-p",
    "key": "u",
    "command": "gnus-group-toggle-subscription-at-point",
    "desc": "Toggle subscription of the current group."
  },
  {
    "short": "suspend",
    "key": "z",
    "command": "gnus-group-suspend",
    "desc": "Suspend the current Gnus session."
  }
]
#+end_example

| M-# | gnus-group-unmark-group                 | Remove the mark from the current group.                                       |
| M-& | gnus-group-universal-argument           | Perform any command on all groups according to the process/prefix convention. |
| M-e | gnus-group-edit-group-method            | Edit the select method of GROUP.                                              |
| M-K | gnus-group-edit-global-kill             | Edit the global kill file.                                                    |
| M-k | gnus-group-edit-local-kill              | Edit a local kill file.                                                       |
| M-d | gnus-group-describe-all-groups          | Pop up a buffer with descriptions of all newsgroups.                          |
| M-g | gnus-group-get-new-news-this-group      | Check for newly arrived news in the current group (and the N-1 next groups).  |
| M-c | gnus-group-clear-data                   | Clear all marks and read ranges from the current group.                       |
| M-p | gnus-group-prev-unread-group-same-level | Go to next N’th unread newsgroup on the same level.                           |
| M-n | gnus-group-next-unread-group-same-level | Go to next N’th unread newsgroup on the same level.                           |


| C-k       | gnus-group-kill-group        | Kill the next N groups.                                      |
| RET       | gnus-group-select-group      | Select this newsgroup.                                       |
| C-w       | gnus-group-kill-region       | Kill newsgroups in current region (excluding current point). |
| C-y       | gnus-group-yank-group        | Yank the last newsgroups killed with C-k, inserting it       |
| SPC       | gnus-group-read-group        | Read news in this newsgroup.                                 |
| DEL       | gnus-group-prev-unread-group | Go to previous N’th unread newsgroup.                        |
| <mouse-2> | gnus-mouse-pick-group        | Enter the group under the mouse pointer.                     |
| <delete>  | gnus-group-prev-unread-group | Go to previous N’th unread newsgroup.                        |

| M-SPC        | gnus-group-visible-select-group     | Select the current group without hiding any articles.                  |
| M-RET        | gnus-group-quick-select-group       | Select the GROUP "quickly".                                            |
| C-c C-s      | gnus-group-sort-groups              | Sort the group buffer according to FUNC.                               |
| C-c C-x      | gnus-group-expire-articles          | Expire all expirable articles in the current newsgroup.                |
| C-c C-l      | gnus-group-list-killed              | List all killed newsgroups in the group buffer.                        |
| C-c C-a      | gnus-group-apropos                  | List all newsgroups that have names that match a regexp.               |
| C-c C-d      | gnus-group-describe-group           | Display a description of the current newsgroup.                        |
| C-c M-g      | gnus-activate-all-groups            | Activate absolutely all groups.                                        |
| C-c C-M-x    | gnus-group-expire-all-groups        | Expire all expirable articles in all newsgroups.                       |
| C-c C-M-a    | gnus-group-description-apropos      | List all newsgroups that have names or descriptions that match REGEXP. |
| C-M-<return> | gnus-group-select-group-ephemerally | Select the current group without doing any processing whatsoever.      |

